Revit 2027 API
ToposolidType.GetContourSetting Method
 Get the contour setting object from the current toposolid type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ContourSetting GetContourSetting()
Public Function GetContourSetting As ContourSetting
public:
ContourSetting^ GetContourSetting()
member GetContourSetting : unit -> ContourSetting
Return Value
ContourSetting
 The contour setting object.
See Also
Reference
ToposolidType Class
Autodesk.Revit.DB Namespace